# Задание №1 Создать функцию, которая будет выдавать сумму всех входящих аргументов
def add(*args):
    return sum(args)


print(add(1, 2, 3))
